cpp-recursive-lambdas.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-19 Tue 17:26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>C++ Lambdas and Recursion</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Gnanesh Kunal">
<meta name="description" content="Short note on C++'s lambdas and recursion."
>
<meta name="keywords" content="CPP, Programming Languages">
<link rel="stylesheet" href="css/stylesheet.css">
</head>
<body>
<div id="content">
<header>
<h1 class="title">C++ Lambdas and Recursion</h1>
</header><p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;Sep 07, 2018&gt;</span></span>
</p>

<p>
Let me say I want to reverse a sequence of elements. First I've to
define a function.
</p>

<p>
One definition:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span> (<span style="color: #6434A3;">void</span>) {
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">sequence</span>
    <span style="color: #6434A3;">void</span> <span style="color: #BA36A5;">reverse</span> (<span style="color: #6434A3;">vector</span>&lt;<span style="color: #6434A3;">int</span>&gt; &amp;arr) {
        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0, <span style="color: #BA36A5;">j</span> = arr.size() - 1;
        <span style="color: #0000FF;">while</span> (i &lt; j) {
            <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">temp</span> = arr[i];
            arr[i++] = arr[j];
            arr[j--] = temp;
        }
    }
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">calls reverse</span>
    <span style="color: #0000FF;">return</span> 0;
}
</pre>
</div>

<p>
But you can't do that in cpp. You compiler complains about it.
</p>

<div class="org-src-container">
<pre class="src src-sh">file.cpp:9:35: error: <span style="color: #0000FF;">function</span> <span style="color: #006699;">definition</span> is not allowed here
  void reverse(vector&lt;int&gt; &amp; arr) {
                                  ^
file.cpp:21:3: error: no matching <span style="color: #0000FF;">function</span> <span style="color: #006699;">for</span> call to <span style="color: #008000;">'reverse'</span>
  reverse(arr);
  ^~~~~~~
</pre>
</div>

<p>
You can't define a function inside another function.
</p>

<p>
So the only approach will be to define it elsewhere.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #6434A3;">void</span> <span style="color: #006699;">reverse</span> (<span style="color: #6434A3;">vector</span>&lt;<span style="color: #6434A3;">int</span>&gt; &amp;<span style="color: #BA36A5;">arr</span>) {
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0, <span style="color: #BA36A5;">j</span> = arr.size() - 1;
    <span style="color: #0000FF;">while</span> (i &lt; j) {
        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">temp</span> = arr[i];
        arr[i++] = arr[j];
        arr[j--] = temp;
    }
}

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span> (<span style="color: #6434A3;">void</span>) {
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">sequence</span>
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">calls reverse</span>
    <span style="color: #0000FF;">return</span> 0;
}
</pre>
</div>

<p>
This just works.
</p>

<div class="org-src-container">
<pre class="src src-sh">[monster@monster tmp]$ clang++ file.cpp &amp;&amp; ./a.out
9 8 7 6 5 4 3 2 1 
[monster@monster tmp]$ 
</pre>
</div>

<p>
It would be better to be modular and write a swap function. Note, we
can't write the <code>swap</code> function inside the reverse function as it isn't
allowed. The standard says a forward declaration is a must but it works
without that in modern compilers.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #6434A3;">void</span> <span style="color: #006699;">swap</span>(<span style="color: #6434A3;">int</span> *<span style="color: #BA36A5;">a</span>, <span style="color: #6434A3;">int</span> *<span style="color: #BA36A5;">b</span>) {
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">temp</span> = *a;
    *a = *b;
    *b = temp;
}

<span style="color: #6434A3;">void</span> <span style="color: #006699;">reverse</span> (<span style="color: #6434A3;">vector</span>&lt;<span style="color: #6434A3;">int</span>&gt; &amp;<span style="color: #BA36A5;">arr</span>) {
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0, <span style="color: #BA36A5;">j</span> = arr.size() - 1;
    <span style="color: #0000FF;">while</span> (i &lt; j) {
        swap(arr[i++], arr[j--]);
    }
}
<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">main here</span>
</pre>
</div>

<p>
<i>Can't we just have the fancy rule to declare function 
anywhere like in many other dynamic and static languages?</i>
</p>

<p>
Long story short, we can. We've got cpp lambdas.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">void</span>) {
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">sequence</span>
    <span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">swap</span> = [](<span style="color: #6434A3;">int</span> *<span style="color: #BA36A5;">a</span>, <span style="color: #6434A3;">int</span> *<span style="color: #BA36A5;">b</span>) {
        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">temp</span> = *a;
        *a = *b;
        *b = temp;
    };

    <span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">reverse</span> = [<span style="color: #D0372D;">swap</span>](<span style="color: #6434A3;">vector</span>&lt;<span style="color: #6434A3;">int</span>&gt; &amp; <span style="color: #BA36A5;">arr</span>) {
        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0, <span style="color: #BA36A5;">j</span> = arr.size() - 1;
        <span style="color: #0000FF;">while</span> (i &lt; j)
            swap(arr[i++], arr[j--]);
    };
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">calls reverse</span>
}
</pre>
</div>

<p>
We can do this as well.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">reverse</span> = [](<span style="color: #6434A3;">vector</span>&lt;<span style="color: #6434A3;">int</span>&gt; &amp;<span style="color: #BA36A5;">arr</span>) {
    <span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">swap</span> = [](<span style="color: #6434A3;">int</span> *<span style="color: #BA36A5;">a</span>, <span style="color: #6434A3;">int</span> *<span style="color: #BA36A5;">b</span>) {
        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">temp</span> = *a;
        *a = *b;
        *b = temp;
    };
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = 0, <span style="color: #BA36A5;">j</span> = arr.size() - 1;
    <span style="color: #0000FF;">while</span> (i &lt; j)
        swap(arr[i++], arr[j--]);
};
</pre>
</div>

<p>
The <code>reverse</code> variable gets a datatype of
<code>function&lt;void(vector&lt;int&gt; &amp;)&gt;</code> and the <code>swap</code> variable gets a dataype
of <code>function&lt;void(int *, int *)&gt;</code>.
</p>

<div id="outline-container-orga4d3f66" class="outline-2">
<h2 id="what-about-recursion"><a id="orga4d3f66"></a>What about recursion?</h2>
<div class="outline-text-2" id="text-what-about-recursion">
<p>
Recursion is a bit tricky. The following code doesn't work.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">factorial</span> = [](<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">n</span>) {
    <span style="color: #0000FF;">if</span> (n &lt;= 1) <span style="color: #0000FF;">return</span> 1;
    <span style="color: #0000FF;">return</span> n * factorial(n - 1);
};
</pre>
</div>

<p>
It doesn't work for various reasons.
</p>

<p>
One of reason is that the return type is not known at all. <code>auto</code> can't
deduce the type. we know what the if statement does, returns <code>1</code>, but
we're not sure what the <code>else</code> statement would do. At least our compiler
doesn't know.
</p>

<div class="org-src-container">
<pre class="src src-sh">file.cpp:9:19: error: variable <span style="color: #008000;">'factorial'</span> declared with deduced type <span style="color: #008000;">'auto'</span>
      cannot appear<span style="color: #0000FF;"> in</span> its own initializer
                     <span style="color: #0000FF;">return</span> n * factorial(n - 1);
                                ^
1 error generated.
</pre>
</div>

<p>
Another the reason is that the <code>factorial</code> lambda function isn't
captured at all. To capture it, we just have to pass the same in the
capture clause, <code>[&amp;]</code>. The <code>&amp;</code> says to pass everything as a reference.
</p>

<div class="org-src-container">
<pre class="src src-cpp">file.<span style="color: #D0372D;">cpp</span>:9:19: error: variable <span style="color: #ff0000; font-weight: bold;">'</span>factorial<span style="color: #ff0000; font-weight: bold;">'</span> cannot be implicitly captured in a
      lambda with no capture-<span style="color: #0000FF;">default</span> specified
                     <span style="color: #0000FF;">return</span> n * factorial(n - 1);
                                ^
file.cpp:7:22: note: <span style="color: #ff0000; font-weight: bold;">'</span>factorial<span style="color: #ff0000; font-weight: bold;">'</span> declared here
  <span style="color: #6434A3;">function</span>&lt;<span style="color: #6434A3;">int</span>(<span style="color: #6434A3;">int</span>)&gt; factorial = [](<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">n</span>) {
                     ^
file.cpp:7:34: note: lambda expression begins here
  <span style="color: #6434A3;">function</span>&lt;<span style="color: #6434A3;">int</span>(<span style="color: #6434A3;">int</span>)&gt; factorial = [](<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">n</span>) {
</pre>
</div>

<p>
Finally this would be our definition.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #6434A3;">function</span>&lt;<span style="color: #6434A3;">int</span>(<span style="color: #6434A3;">int</span>)&gt; <span style="color: #BA36A5;">factorial</span> = [&amp;](<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">n</span>) {
    <span style="color: #0000FF;">if</span> (n &lt;= 1) <span style="color: #0000FF;">return</span> 1;
    <span style="color: #0000FF;">return</span> n * factorial(n - 1);
};
</pre>
</div>

<p>
<i>The only thing we've gained by lambdas are just that they
can be defined anywhere.</i>
</p>

<p>
Well that's not true though. <code>cpp14</code> adds much more to it.
</p>

<p>
In cpp14, even the parameters can be defined using <code>auto</code>.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">lambda</span> = [](<span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">x</span>, <span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">y</span>) {
    <span style="color: #0000FF;">return</span> x + y;
};
</pre>
</div>

<p>
The above code will be equivalent to
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #0000FF;">struct</span> <span style="color: #6434A3;">unnamed_lambda</span> {
    <span style="color: #0000FF;">template</span>&lt;<span style="color: #0000FF;">typename</span> <span style="color: #6434A3;">T</span>, <span style="color: #0000FF;">typename</span> <span style="color: #6434A3;">U</span>&gt;
        <span style="color: #0000FF;">auto</span> <span style="color: #0000FF;">operator</span><span style="color: #006699;">()</span>(<span style="color: #6434A3;">T</span> <span style="color: #BA36A5;">x</span>, <span style="color: #6434A3;">U</span> <span style="color: #BA36A5;">y</span>) <span style="color: #0000FF;">const</span> {
            <span style="color: #0000FF;">return</span> x + y;
        }
    };
};
<span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">lambda</span> = unnamed_lambda{};
</pre>
</div>

<p>
The actual problem with lambdas is recursions. As said earlier we can
define a <code>function&lt;&gt;</code> type and create a lambda function, but the problem
with using <code>function&lt;&gt;</code> type is that <code>std::function</code> has performance
issues because it does heap allocations.
</p>

<p>
So the recursions in lambdas are applicable only when you define a
<code>function&lt;&gt;</code> type. That was true until cpp11. But as cpp14 allowed the
parameters to have <code>auto</code> declaration, we can pass the lambda function
itself as an argument.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">factorial</span> = [](<span style="color: #0000FF;">auto</span> &amp;&amp;<span style="color: #BA36A5;">self</span>, <span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">n</span>) {
    <span style="color: #0000FF;">if</span> (n &lt;= 1) <span style="color: #0000FF;">return</span> 1;
    <span style="color: #0000FF;">return</span> n * self(self, n - 1);
};

<span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">usage: </span>
factorial(factorial, 5);
</pre>
</div>

<p>
The <code>&amp;&amp;</code> is an RValue reference. We can ignore it, but as we're not
changing it, we can just pass it as a reference. And look, we don't have
to capture the function itself for recursion as the function is captured
as an argument.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

<hr></hr>
<div class="nav">
<ul>
<li><a href="index.html">Home</a></li>
<li><a href="about.html">About</a></li>
<li><a href="https://github.com/Gnaneshkunal">GitHub</a></li>
<li><a href="resume.pdf">Resume</a></li>
</ul>
</div>
</div>
</body>
</html>
